# 2장 데이터 핸들링

In [1]:
import pandas as pd
import numpy as np
from sklearn.datasets import load_iris

In [2]:
# dataset
dataset = np.array([['kor',70], ['math', 80]])

In [3]:
df = pd.DataFrame(dataset, columns=['class','score'])
df = pd.DataFrame({'class':['kor','math'], 'score':[70,80]})
df

  class  score
0   kor     70
1  math     80

In [4]:
# DataFrame 읽어오기
#filepath = 'dataset/data.csv'
#data = pd.read_csv(filepath, na_value = 'NA', encoding='utf8')
# DataFrame 저장하기
#data.to_csv('이름.csv',header=True, index=True, encoding='utf8')

In [5]:
# iris 데이터 셋 준비
iris = load_iris()
iris = pd.DataFrame(iris.data, columns=iris.feature_names)
iris.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [6]:
#pd.set_option('display.max_columns',None) # 모든 열 출력
#pd.set_option('display.max_rows',None) # 모든 행 출력

### DataFrame 요약, 통계 정보보기

In [7]:
iris.info()
# iris 데이터의 열은 sepal length, sepal width, petal length, petal width로 4개, 결측값은 0, 모두 실수형 변수이다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
dtypes: float64(4)
memory usage: 4.8 KB

In [8]:
iris.describe()
# sepal.length의 범위는 4.3 ~ 7.9이고 patal width의 범위는  0.1 ~ 2.5로 범위의 차이가 크다
# -> 회귀분석을 수행할 경우 값의 숫자가 다른 컬럼들에 비해 상대적으로 작으면 분석모델에 미치는 영향력이 적다. 따라서 정규화과정 필요

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

## DataFrame 인덱스 확인, 추가, 리셋

In [9]:
list(df.index)

[0, 1]

In [10]:
df.index= ["A","B"]
df.index

Index(['A', 'B'], dtype='object')

In [11]:
df

  class  score
A   kor     70
B  math     80

In [12]:
df.set_index('class', drop=True, append = False, inplace = True)
# DataFrame.set_index(keys, drop, append, inplace)
# keys: 인덱스로 사용하고자 하는 컬럼의 이름
# drop: 인덱스로 세팅한 컬럼을 DataFrame 내에서 삭제할지 결정
# append: 기존에 존재하던 인덱스 삭제할지, 컬럼으로 추가할지 결정
# inplace: 원본 객체를 변경할지를 결정
df

       score
class
kor       70
math      80

In [13]:
df.reset_index(drop = False, inplace = True)
# DataFrame.reset_index(drop= False, inplace= False)
# drop: 기존 인덱스를 DataFrame 내에서 삭저할지, 컬럼으로 추가할지를 결정
# inplace: 원본 객체를 변경할지 결정
df

  class  score
0   kor     70
1  math     80

###  dataFrame 컬럼명 확인 및 변경

In [14]:
iris.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)'],
      dtype='object')

In [15]:
iris.columns = ['sepal length', 'sepal width', 'petal length', 'petal width']
iris

     sepal length  sepal width  petal length  petal width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [16]:
iris.colums = iris.columns.str.replace(' ', '_')
# DataFrame.columns.str.replace('기존문자','대체할문자')

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_34932\3125647448.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  iris.colums = iris.columns.str.replace(' ', '_')

In [17]:
iris.columns = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width']
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2

### 데이터프레임 컬럼 데이터 타입 확인 및 변경

In [18]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
dtype: object

In [19]:
iris['sepal_length'] = iris['sepal_width'].astype('int')
iris[['sepal_width','petal_length']] = iris[['sepal_width','petal_length']].astype('int')
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width
0             3            3             1          0.2
1             3            3             1          0.2
2             3            3             1          0.2

### 행/ 열 선택, 추가, 삭제

#### iloc과 loc의 차이점
iloc은 파이썬의 슬라이싱과 같이 end - 1까지 loc은 end까지

In [20]:
# iloc, loc
iris.iloc[1:4]

   sepal_length  sepal_width  petal_length  petal_width
1             3            3             1          0.2
2             3            3             1          0.2
3             3            3             1          0.2

In [21]:
iris.iloc[[1,3,5],2:4]

   petal_length  petal_width
1             1          0.2
3             1          0.2
5             1          0.4

In [22]:
iris.iloc[:,[True, True, False, True]]

     sepal_length  sepal_width  petal_width
0               3            3          0.2
1               3            3          0.2
2               3            3          0.2
3               3            3          0.2
4               3            3          0.2
..            ...          ...          ...
145             3            3          2.3
146             2            2          1.9
147             3            3          2.0
148             3            3          2.3
149             3            3          1.8

[150 rows x 3 columns]

In [23]:
iris.loc[1:3]

   sepal_length  sepal_width  petal_length  petal_width
1             3            3             1          0.2
2             3            3             1          0.2
3             3            3             1          0.2

In [24]:
iris.loc[1:2, 'sepal_length':'petal_length']

   sepal_length  sepal_width  petal_length
1             3            3             1
2             3            3             1

### 선택한 값 변경하기

In [25]:
score = pd.DataFrame({'국어':[100,80],'수학':[75,90],'영어':[90,95]},index=['장화','홍련'])
score

     국어  수학  영어
장화  100  75  90
홍련   80  90  95

In [26]:
score.loc['홍련','영어'] = 100
score

     국어  수학   영어
장화  100  75   90
홍련   80  90  100

In [27]:
score['국어']= score['국어']-5

In [28]:
score

    국어  수학   영어
장화  95  75   90
홍련  75  90  100

### row 추가

In [29]:
new_students = pd.DataFrame({"국어":[70,85],"수학":[65,100],'영어':[90,65]},index=["콩쥐","팥쥐"])
score = score.append(new_students)
new_student1 = pd.Series({"국어":85,'수학':55,"영어":95},name = "해님")
score = score.append(new_student1)
score

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_34932\934017422.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_students)
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_34932\934017422.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_student1)

    국어   수학   영어
장화  95   75   90
홍련  75   90  100
콩쥐  70   65   90
팥쥐  85  100   65
해님  85   55   95

In [30]:
new_student2 ={"국어":75,"수학":80,"영어":80}
score.append(new_student2, ignore_index=True)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_34932\3247751072.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score.append(new_student2, ignore_index=True)

   국어   수학   영어
0  95   75   90
1  75   90  100
2  70   65   90
3  85  100   65
4  85   55   95
5  75   80   80

### column 추가

In [31]:
science = [80,70,90,85,75]
score['과학']= science 
score['학년']=1
score

    국어   수학   영어  과학  학년
장화  95   75   90  80   1
홍련  75   90  100  70   1
콩쥐  70   65   90  90   1
팥쥐  85  100   65  85   1
해님  85   55   95  75   1

In [32]:
score['총점'] = score.국어+score.수학+score.영어+score.과학
score

    국어   수학   영어  과학  학년   총점
장화  95   75   90  80   1  340
홍련  75   90  100  70   1  335
콩쥐  70   65   90  90   1  315
팥쥐  85  100   65  85   1  335
해님  85   55   95  75   1  310

### row/column 삭제

In [33]:
score.drop('장화',inplace=True)
score.drop(columns = ['과학','학년','총점'],inplace=True)
score

    국어   수학   영어
홍련  75   90  100
콩쥐  70   65   90
팥쥐  85  100   65
해님  85   55   95

## 4절 조건에 맞는 데이터 탐색 및 수정

### (1) 임의의 조건 탐색 및 데이터 수정

In [34]:
students = pd.DataFrame({'이름':['장화','홍련','콩쥐','팥쥐','해님','달님'],
                        '국어':[70,85,None,100,None,85],
                        '수학':[65,100,80,95,None,70]})
students

   이름     국어     수학
0  장화   70.0   65.0
1  홍련   85.0  100.0
2  콩쥐    NaN   80.0
3  팥쥐  100.0   95.0
4  해님    NaN    NaN
5  달님   85.0   70.0

In [35]:
students[students['이름']=='장화']

   이름    국어    수학
0  장화  70.0  65.0

In [36]:
students[(students['국어']>=80)& (students['수학']>=80)]

   이름     국어     수학
1  홍련   85.0  100.0
3  팥쥐  100.0   95.0

In [37]:
students.loc[6,'이름':'수학'] = ['별님',50,60]

In [38]:
students.loc[(students['국어']>=80)&(students['수학']>=70),'합격']='Pass'
students.loc[students['합격']!='Pass','합격'] = 'Fail'

In [39]:
students

   이름     국어     수학    합격
0  장화   70.0   65.0  Fail
1  홍련   85.0  100.0  Pass
2  콩쥐    NaN   80.0  Fail
3  팥쥐  100.0   95.0  Pass
4  해님    NaN    NaN  Fail
5  달님   85.0   70.0  Pass
6  별님   50.0   60.0  Fail

In [40]:
condition_list = [(students['국어']>=90),
                (students['국어']>=80)& (students['국어']<90),
                (students['국어']>=70&(students['국어']<80))]
choice_list = ["A","B","C"]
students['점수']=np.select(condition_list,choice_list,default = 'F')
students

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
2  콩쥐    NaN   80.0  Fail  F
3  팥쥐  100.0   95.0  Pass  A
4  해님    NaN    NaN  Fail  F
5  달님   85.0   70.0  Pass  B
6  별님   50.0   60.0  Fail  C

### (2) 결측치 탐색 및 수정

In [41]:
students.isna()

      이름     국어     수학     합격     점수
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False  False  False  False  False
6  False  False  False  False  False

In [42]:
students.isna().sum()

이름    0
국어    2
수학    1
합격    0
점수    0
dtype: int64

In [43]:
# 결측치 제거
# DataFrame.dropna(axis=0, how='any', thresh='None',subset=None.inplace=False)
# axis : 0 or index 이면 결측값이 포함된 행을 삭제, 1 or columns 이면 결측값을 포함한 열 삭제
# how : 'any' 이면 결측값이 존재하는 모든 행/ 삭제, 'all'이면 모든 값이 결측값일때 삭제
# thresh : 정숫값을 지저하면 결측값이 아닌 값이 그보다 많을 때 행 또는 열을 유지
# subset: 어떤 레이블에 결측값이 존재하면 삭제할지 결정
# inplace: True이면 제자리에서 작업을 수행
students.dropna().reset_index(drop=True)

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
2  팥쥐  100.0   95.0  Pass  A
3  달님   85.0   70.0  Pass  B
4  별님   50.0   60.0  Fail  C

In [44]:
students.dropna(thresh=4) # 결측값이 아닌 값이 4개보다 많은 행만 남기기

   이름     국어     수학    합격 점수
0  장화   70.0   65.0  Fail  C
1  홍련   85.0  100.0  Pass  B
2  콩쥐    NaN   80.0  Fail  F
3  팥쥐  100.0   95.0  Pass  A
5  달님   85.0   70.0  Pass  B
6  별님   50.0   60.0  Fail  C

In [45]:
# 결측치 대체
# DataFrame.fillna(value = None, method=None, axis=None, inplace=False, limint=None)
# value: 단일 값 혹은 dict/Series/DataFrame 형식으로 대체할 값을 입력
# method :' pad','fill' 이전 값으로 채우고, 'backfill'/'bfill'은 다음에 오는 값으로 채움
# axis : 0 또는 'index'이면 행 방향으로 채우고 1 또는 'columns'이면 열 방향으로 채움
# limint : method 인자를 지정한 경우 limit 으로 지정한 게수만큼만 대체할 수 있음

In [46]:
health = pd.DataFrame({'연도':[2017,2018,2019,2020,2021,2022],
                      '키':[160,162,165,None,None,166],
                      '몸무게':[53,52,None,50,51,54],
                      '시력':[1.2,None,1.2,1.2,1.1,0.8],
                      '병결':[None,None,None,2,None,1]})
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  NaN
1  2018  162.0  52.0  NaN  NaN
2  2019  165.0   NaN  1.2  NaN
3  2020    NaN  50.0  1.2  2.0
4  2021    NaN  51.0  1.1  NaN
5  2022  166.0  54.0  0.8  1.0

In [47]:
health.fillna(0)

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  0.0  0.0
2  2019  165.0   0.0  1.2  0.0
3  2020    0.0  50.0  1.2  2.0
4  2021    0.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [48]:
health.fillna(health.mean())

     연도       키   몸무게   시력   병결
0  2017  160.00  53.0  1.2  1.5
1  2018  162.00  52.0  1.1  1.5
2  2019  165.00  52.0  1.2  1.5
3  2020  163.25  50.0  1.2  2.0
4  2021  163.25  51.0  1.1  1.5
5  2022  166.00  54.0  0.8  1.0

In [49]:
health['병결']=health['병결'].fillna(0)
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  NaN  0.0
2  2019  165.0   NaN  1.2  0.0
3  2020    NaN  50.0  1.2  2.0
4  2021    NaN  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [50]:
health['몸무게']= health['몸무게'].fillna(health['몸무게'].mean())
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  NaN  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020    NaN  50.0  1.2  2.0
4  2021    NaN  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

In [51]:
health.fillna(method='pad',inplace=True)
health

     연도      키   몸무게   시력   병결
0  2017  160.0  53.0  1.2  0.0
1  2018  162.0  52.0  1.2  0.0
2  2019  165.0  52.0  1.2  0.0
3  2020  165.0  50.0  1.2  2.0
4  2021  165.0  51.0  1.1  0.0
5  2022  166.0  54.0  0.8  1.0

### (3) 중복행 삭제

In [52]:
health['키'].drop_duplicates()

0    160.0
1    162.0
2    165.0
5    166.0
Name: 키, dtype: float64

In [53]:
health[['시력','병결']].drop_duplicates()

    시력   병결
0  1.2  0.0
3  1.2  2.0
4  1.1  0.0
5  0.8  1.0

## 5절 데이터 정렬

In [54]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width
0             3            3             1          0.2
1             3            3             1          0.2
2             3            3             1          0.2
3             3            3             1          0.2
4             3            3             1          0.2

In [55]:
iris.sort_index(ascending=False, inplace=True)
iris.head()

     sepal_length  sepal_width  petal_length  petal_width
149             3            3             5          1.8
148             3            3             5          2.3
147             3            3             5          2.0
146             2            2             5          1.9
145             3            3             5          2.3

In [56]:
iris.sort_index(axis=1, ascending=True, inplace=True)
iris.head()

     petal_length  petal_width  sepal_length  sepal_width
149             5          1.8             3            3
148             5          2.3             3            3
147             5          2.0             3            3
146             5          1.9             2            2
145             5          2.3             3            3

In [57]:
iris.sort_values('petal_length')

     petal_length  petal_width  sepal_length  sepal_width
0               1          0.2             3            3
28              1          0.2             3            3
29              1          0.2             3            3
30              1          0.2             3            3
31              1          0.4             3            3
..            ...          ...           ...          ...
130             6          1.9             2            2
117             6          2.2             3            3
118             6          2.3             2            2
100             6          2.5             3            3
125             6          1.8             3            3

[150 rows x 4 columns]

## 6절 데이터 결합

pd.concat([데이터프레임1,데이터프레임2], axis=0, ignore_index = False)\
ignore_index : True이면 기존 index를 무시하고 새로 설정

In [58]:
df1 = pd.DataFrame({'이름':['장화','홍련'],
                   '부서':['영업','회계'],
                  '직급':['팀장','사원']})
df2 = pd.DataFrame({'이름':['콩쥐','팥쥐'],
                   '직급':['사원','팀장'],
                  '부서':['영업','인사']})

In [59]:
df1

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원

In [60]:
df2

   이름  직급  부서
0  콩쥐  사원  영업
1  팥쥐  팀장  인사

In [61]:
pd.concat([df1,df2],axis=0,ignore_index=True)

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원
2  콩쥐  영업  사원
3  팥쥐  인사  팀장

In [62]:
df3 = pd.DataFrame({'이름':['콩쥐','팥쥐'],
                   '부서':['영업','인사'],
                   '급여':[3500,2800]})
pd.concat([df1,df3],axis=0,ignore_index=True)

   이름  부서   직급      급여
0  장화  영업   팀장     NaN
1  홍련  회계   사원     NaN
2  콩쥐  영업  NaN  3500.0
3  팥쥐  인사  NaN  2800.0

In [63]:
df1

   이름  부서  직급
0  장화  영업  팀장
1  홍련  회계  사원

In [64]:
df4 = pd.Series({1:2500},name='급여')
pd.concat([df1,df4], axis=1)

   이름  부서  직급      급여
0  장화  영업  팀장     NaN
1  홍련  회계  사원  2500.0

In [65]:
df5 = pd.DataFrame({'급여':[4500,3000,3500]})
pd.concat([df1,df5],axis=1)

    이름   부서   직급    급여
0   장화   영업   팀장  4500
1   홍련   회계   사원  3000
2  NaN  NaN  NaN  3500

In [66]:
product = pd.DataFrame({'상품코드':['G1','G2','G3','G4'],
                       '상품명':['우유','감자','빵','치킨']})
sale = pd.DataFrame({'주문번호':[1001,1002,1002,1003,1004],
                    '상품코드':['G4','G3','G1','G3','G5'],
                    '주문수량':[1,4,2,2,3]})

In [67]:
product

  상품코드 상품명
0   G1  우유
1   G2  감자
2   G3   빵
3   G4  치킨

In [68]:
sale

   주문번호 상품코드  주문수량
0  1001   G4     1
1  1002   G3     4
2  1002   G1     2
3  1003   G3     2
4  1004   G5     3

In [69]:
sale.merge(product, on='상품코드', how= 'inner')

   주문번호 상품코드  주문수량 상품명
0  1001   G4     1  치킨
1  1002   G3     4   빵
2  1003   G3     2   빵
3  1002   G1     2  우유

In [70]:
sale.merge(product, on='상품코드', how= 'outer',sort=True)

     주문번호 상품코드  주문수량  상품명
0  1002.0   G1   2.0   우유
1     NaN   G2   NaN   감자
2  1002.0   G3   4.0    빵
3  1003.0   G3   2.0    빵
4  1001.0   G4   1.0   치킨
5  1004.0   G5   3.0  NaN

In [71]:
sale.merge(product, left_on='상품코드', right_on='상품코드',how='left')

   주문번호 상품코드  주문수량  상품명
0  1001   G4     1   치킨
1  1002   G3     4    빵
2  1002   G1     2   우유
3  1003   G3     2    빵
4  1004   G5     3  NaN

## 7절 데이터요약

DataFrame.groupby(by=None, axis=0, level = None, as_index=True, sort=False, dropna= True).Fun()

In [72]:
IRIS = load_iris()

In [73]:
iris = pd.DataFrame(data=IRIS.data, columns =IRIS.feature_names)

In [74]:
iris

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [75]:
iris['class'] = IRIS.target

In [76]:
iris['class']

0      0
1      0
2      0
3      0
4      0
      ..
145    2
146    2
147    2
148    2
149    2
Name: class, Length: 150, dtype: int32

In [77]:
iris['class'] = iris['class'].map({0:'setosa',1:'versicolor', 2:"virginica"})

In [78]:
iris.groupby(by='class').mean().reset_index()

,class,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
0,setosa,5.006,3.428,1.462,0.246
1,versicolor,5.936,2.770,4.260,1.326
2,virginica,6.588,2.974,5.552,2.026

## 데이터 재구조화

In [79]:
score = pd.DataFrame({'학년':[1,1,1,1,2,2],
        '반':['A','A','B','B','C','C'],
         '성별':['여자','남자','여자','남자','여자','남자',],
         '성적':[76,88,85,72,68,70]})
score

   학년  반  성별  성적
0   1  A  여자  76
1   1  A  남자  88
2   1  B  여자  85
3   1  B  남자  72
4   2  C  여자  68
5   2  C  남자  70

In [80]:
score.pivot_table(index=['학년','반'], columns='성별',values='성적')

성별    남자  여자
학년 반
1  A  88  76
   B  72  85
2  C  70  68

In [81]:
score = score.pivot_table(index=['학년','반'], columns='성별',values='성적')

In [82]:
score

성별    남자  여자
학년 반
1  A  88  76
   B  72  85
2  C  70  68

In [83]:
score.reset_index()

성별  학년  반  남자  여자
0    1  A  88  76
1    1  B  72  85
2    2  C  70  68

In [84]:
score.reset_index().melt(id_vars=['학년','반'],var_name='성별',value_name='성적')

   학년  반  성별  성적
0   1  A  남자  88
1   1  B  남자  72
2   2  C  남자  70
3   1  A  여자  76
4   1  B  여자  85
5   2  C  여자  68

## 데이터프레임에 함수 적용하기

In [85]:
score.apply(np.max,axis=0)

성별
남자    88
여자    85
dtype: int64

In [86]:
score['남자'].apply(lambda x: x+9)

학년  반
1   A    97
    B    81
2   C    79
Name: 남자, dtype: int64

In [87]:
score['남자'].map(lambda x: x+5)

학년  반
1   A    93
    B    77
2   C    75
Name: 남자, dtype: int64

## 문자열 데이터 변환하기

In [88]:
landmark = pd.DataFrame({'name':['광호문','호미곶','첨성대'],
                       'location':['서울 종로구 사직로 161',
                                  '경북 포항시 남구 호미곶면 대보리 150',
                                  '경북 경주시 인왕동 839-1']})
landmark

  name                location
0  광호문          서울 종로구 사직로 161
1  호미곶  경북 포항시 남구 호미곶면 대보리 150
2  첨성대        경북 경주시 인왕동 839-1

In [89]:
landmark['location'].str[3:6]

0    종로구
1    포항시
2    경주시
Name: location, dtype: object

In [92]:
landmark['location'].str.split(" ", expand=True)

    0    1    2      3     4     5
0  서울  종로구  사직로    161  None  None
1  경북  포항시   남구   호미곶면   대보리   150
2  경북  경주시  인왕동  839-1  None  None

In [93]:
landmark['loc_1'] = landmark['location'].str.split(" ").str[0]

In [94]:
landmark

  name                location loc_1
0  광호문          서울 종로구 사직로 161    서울
1  호미곶  경북 포항시 남구 호미곶면 대보리 150    경북
2  첨성대        경북 경주시 인왕동 839-1    경북

In [98]:
landmark['location'].str.startswith('서울')

0     True
1    False
2    False
Name: location, dtype: bool

In [101]:
landmark['location'].str.endswith('1')

0     True
1    False
2     True
Name: location, dtype: bool

In [103]:
landmark['location'].str.contains('1')

0    True
1    True
2    True
Name: location, dtype: bool

## 날짜 데이터 핸들링

In [105]:
from datetime import datetime

In [106]:
datetime.today()

datetime.datetime(2023, 1, 11, 19, 46, 10, 620305)

In [107]:
datetime.now()

datetime.datetime(2023, 1, 11, 19, 46, 21, 78841)

In [108]:
datetime.now().year

2023

특정 열 데이터를 날짜 형식으로 변경하기
pd.to_datetime(df['Datetime'],format = '%Y-%m-%d %H:%M:%S')

날짜 형식 문자열로 변화
time.strftime('%Y-%m-%d %H:%M:%S')